<template>
  <div class="markdown-body">
    <h1>使用条款</h1>
    <p><em>最后修改日期：2023年9月16日</em></p>
    <h2>接受使用条款</h2>
    <p>
      这些使用条款由您和 Rinth, Inc.（以下简称“公司”、“我们”或“我们”）之间订立。以下条款和条件连同明确纳入的任何文件（统称为“使用条款”）管理您对 www.bbsmc.net、api.bbsmc.net 或 BBSMC 应用程序的访问和使用，包括通过 www.bbsmc.net、api.bbsmc.net 或 BBSMC 应用程序提供的任何内容、功能和服务（“服务”），无论您是访客还是注册用户。
    </p>
    <p>
      在开始使用服务之前，请仔细阅读使用条款。通过访问或使用服务，您接受并同意受这些使用条款、我们的隐私政策、版权政策和加利福尼亚隐私声明的约束和遵守。如果您不同意这些条款和政策，您不能访问或使用服务。
    </p>
    <p>
      服务供13岁或以上的用户使用。通过使用服务，您声明并保证您已达法定年龄与公司签订具有约束力的合同，并满足所有前述资格要求。如果您不符合这些要求，您不能访问或使用服务。
    </p>
    <h2>使用条款的更改</h2>
    <p>
      我们可能会自行决定不时修订和更新这些使用条款。所有更改在发布后立即生效，并适用于此后对服务的所有访问和使用。
    </p>
    <p>
      您继续使用服务表示您接受并同意这些更改。您应该每次访问服务时查看此页面，以便了解任何更改，因为这些更改对您具有约束力。
    </p>
    <h2>访问服务和帐户安全</h2>
    <p>
      我们保留随时自行决定撤回或修改服务或通过服务提供的任何服务或材料的权利，而无需事先通知。如果由于任何原因服务的全部或部分在任何时间不可用，我们将不承担责任。我们可能不时限制用户访问服务的某些部分或整个服务，包括注册用户。
    </p>
    <p>
      您有责任安排所有必要的安排，以便您可以访问服务，并确保所有通过您的互联网连接访问服务的人了解这些使用条款并遵守这些条款。
    </p>
    <p>
      要访问服务或服务提供的某些资源，您可能需要提供某些注册详细信息或其他信息。您使用服务的条件是您在服务上提供的所有信息都是正确、最新和完整的。您同意您提供用于注册服务或其他用途的所有信息，包括但不限于通过服务的任何交互功能使用的信息，受我们的隐私政策管辖，并且您同意我们根据我们的隐私政策对您的信息采取的所有行动与我们的隐私政策一致。
    </p>
    <p>
      如果您选择或提供电子邮件、密码或任何其他信息作为我们的安全程序的一部分，您必须将此类信息视为机密，并且您不得将其透露给任何其他人或实体。您还承认您的帐户是个人的，并同意不向任何其他人提供使用您的用户名、密码或其他安全信息的服务或其部分的访问权限（如果您这样做，您同意对任何提供此类信息的任何人造成的任何损害负责并赔偿、辩护和使我们免受任何损害。由于任何这样的人给您提供任何此类信息）。您同意立即通知我们任何未经授权访问或使用您的用户名或密码或任何其他安全漏洞。在使用公共或共享计算机访问您的帐户时，您应特别小心，以确保其他人无法查看或记录您的密码或其他个人信息。
    </p>
    <p>
      我们有权随时自行决定在任何理由或无理由情况下禁用任何由您选择或我们提供的用户名、密码或其他标识符，包括如果在我们看来您违反了这些使用条款的任何规定。
    </p>
    <h2>关于服务</h2>
    <p>
      服务允许您上传和分享您的游戏内容（“游戏内容”，与下文定义的用户贡献区分开来）与我们服务的其他用户。与公司拥有的用户贡献不同，当您使用服务并上传和分享您的游戏内容时，公司不主张对您的游戏内容拥有任何权利、所有权或利益。同时，公司对与游戏内容相关的任何和所有责任均不承担，您完全负责与游戏内容相关的任何和所有索赔、行动、损害等。
    </p>
    <p>
      当您上传您的游戏内容时，您在此授予我们有限的使用、非独占、免版税、全额付款的权利，以通过服务将您的游戏内容展示和分发给我们的用户，而我们的用户又可以根据自己的独立裁量权使用该内容。
    </p>
    <p>
      当您删除您的游戏内容时，您同意根据前述许可继续使用您的游戏内容的任何用户，这些用户以前已根据前述许可下载了您的游戏内容，并且您还同意您的游戏内容可能继续成为其他用户作为我们服务的一部分已存在的游戏内容“包”的一部分，直到这些游戏内容被这些用户删除为止。为了避免疑问，就公司和您之间的关系而言，您拥有并将继续拥有您的游戏内容的所有权利、所有权和利益。
    </p>
    <p>
      所有游戏内容必须遵守 <nuxt-link to="/legal2/rules">内容规则</nuxt-link>。
    </p>
    <h2>API使用</h2>
    <p>
      作为我们服务的一部分，我们提供一种称为应用程序编程接口（BBSMC API）的工具。BBSMC API使用户可以通过自己的服务，如其网站和/或应用程序，在服务上执行操作。
    </p>
    <p>
      我们授予BBSMC API的用户一项有限的、非独占的、不可转让的和可撤销的许可，以通过其自己的服务，如其网站和/或应用程序下载、显示、查询、创建、编辑和删除服务上的用户生成内容（用户生成内容）（API许可），前提是用户遵守以下条件：
    </p>
    <ul>
      <li>
        用户使用BBSMC API应符合这些条款、社区标准和适用于此类使用的所有适用法律法规。
      </li>
      <li>用户不侵犯第三方的任何权利。</li>
      <li>
        用户应向BBSMC提供所请求的所有协助，以遵守并达成适用法律法规所要求的所有协议。
      </li>
    </ul>
    <p>
      使用BBSMC API的每个用户应对所有由其他用户或任何其他第三方（包括政府机构）提出的所有索赔、诉讼或行动进行赔偿。
    </p>
<!--    <h2>我们的奖励计划</h2>-->
<!--    <p>-->
<!--      我们的奖励计划（“奖励计划”）为开发人员和内容创作者提供了一个机会，他们可以通过将其上传到服务的项目实现货币化。-->
<!--    </p>-->
<!--    <p>-->
<!--      公司支付给您我们收取的与仅在您的项目页面上显示的广告展示相关的净收入的一部分。这些资金直接存入您的帐户，您可以通过您的创作者仪表板监控和访问。只需在您的仪表板上注册奖励计划，即可利用该计划。请查看 <nuxt-link to="/legal/cmp">奖励计划条款</nuxt-link>，因为它包含非常重要的条款，包括您作为独立承包商的身份、您负责支付税款、我们的免责声明和责任限制（除了我们在这些使用条款中的免责声明和责任限制）。-->
<!--    </p>-->
    <h2>知识产权</h2>
    <p>
      除了游戏内容外，服务及其全部内容、功能（包括但不限于所有信息、软件、文本、显示、图像、视频和音频以及其设计、选择和排列方式）均为公司、其许可方或其他提供者拥有，并受到美国和国际版权、商标、专利、商业秘密和其他知识产权或专有权利法律的保护。
    </p>
    <p>
      这些使用条款允许您仅用于个人、非商业用途使用服务。
    </p>
    <p>
      您不会被转让对服务或其中包含的任何内容的任何权利、所有权或利益，除非明确授予的所有权利均由公司保留。未经这些使用条款明确许可的服务的任何使用均构成对这些使用条款的违反，可能违反版权、商标和其他法律。
    </p>
    <h2>商标</h2>
    <p>
      公司名称、BBSMC术语、公司标识及所有相关名称、标识、产品和服务名称、设计和口号均为公司或其关联公司或许可方的商标。未经公司事先书面许可，您不得使用这些标记。服务中包含的所有其他名称、标识、产品和服务名称、设计和口号均为其各自所有者的商标。
    </p>
    <h2>禁止使用</h2>
    <p>
      您只能以合法目的并遵守这些使用条款使用服务。您同意不得使用服务：
    </p>
    <ul>
      <li>
        以任何违反任何适用的联邦、州、地方法律或法规（包括但不限于有关数据或软件出口到美国或其他国家的法律）的方式。
      </li>
      <li>
        为了以任何方式利用、伤害或试图利用或伤害未成年人，使他们接触不当内容、要求提供个人身份信息或其他方式。
      </li>
      <li>
        发送、知情接收、上传、下载、使用或重新使用任何不符合 <nuxt-link to="/legal2/rules">内容规则</nuxt-link>的材料。
      </li>
      <li>
        传输或请求发送任何广告或推广材料，包括任何“垃圾邮件”、“连锁信”或“垃圾邮件”或任何其他类似的招揽。
      </li>
      <li>
        冒充或试图冒充公司、公司员工、其他用户或任何其他人或实体（包括但不限于使用与前述任何人相关的电子邮件地址或屏幕名称）。
      </li>
      <li>
        从事任何其他可能限制或阻碍任何人对服务的使用或享受的行为，或者我们认为可能损害公司或服务的用户或使他们承担责任的行为。
      </li>
    </ul>
    <p>此外，您同意不得：</p>
    <ul>
      <li>
        以可能禁用、超负荷、损坏或影响网站或干扰任何其他方使用服务的方式使用服务，包括他们通过服务进行实时活动的能力。
      </li>
      <li>
        使用任何机器人、蜘蛛或其他自动设备、过程或手段访问服务，包括监视或复制服务中包含的任何材料。
      </li>
      <li>
        使用任何手动过程监视或复制服务中包含的任何材料或用于任何未经授权目的的其他手动过程，没有我们事先书面同意。
      </li>
      <li>
        使用任何干扰服务正常运行的设备、软件或例程。
      </li>
      <li>
        引入任何病毒、木马、蠕虫、逻辑炸弹或其他可能是恶意或技术上有害的材料。
      </li>
      <li>
        试图未经授权访问、干扰、损坏或中断服务的任何部分，存储服务的服务器或与服务连接的任何服务器、计算机或数据库。
      </li>
      <li>
        通过拒绝服务攻击或分布式拒绝服务攻击攻击服务。
      </li>
      <li>否则试图干扰服务的正常运行。</li>
    </ul>
    <h2>用户贡献</h2>
    <p>
      服务可能包含留言板、聊天室、个人网页或个人资料、论坛、公告板和其他互动功能（统称为“互动服务”），允许用户向其他用户或其他人发布、提交、发布、显示或传输（以下简称“发布”）内容（除了上文定义的游戏内容之外的内容）或材料（统称为“用户贡献”）在服务上或通过服务。
    </p>
    <p>
      所有用户贡献和使用互动服务必须遵守 <nuxt-link to="/legal2/rules">内容规则</nuxt-link>。
    </p>
    <p>
      您在网站上发布的任何用户贡献将被视为非保密和非专有的。通过服务提供任何用户贡献，您授予我们、我们的关联公司和服务提供商以及各自的许可方、继承人和受让方使用、复制、修改、执行、显示、分发和向第三方披露任何此类材料的权利，以便与您的帐户设置一致的任何目的。
    </p>
    <p>您声明并保证：</p>
    <ul>
      <li>
        您拥有或控制您发布的所有用户贡献的所有权或其他必要权利；
      </li>
      <li>
        用户贡献是准确的，不会误导，且不会导致混淆；
      </li>
      <li>
        使用和发布用户贡献不会侵犯任何第三方的知识产权、隐私权、公开权、道德权或其他个人或专有权利；
      </li>
      <li>
        用户贡献不包含任何淫秽、诽谤、侮辱、侵犯隐私、侵犯版权或其他违法或不道德的内容；
      </li>
      <li>
        您不会通过用户贡献传播任何广告、促销材料、垃圾邮件或任何其他未经请求的形式；
      </li>
      <li>
        您不会利用互动服务干扰或打扰其他用户的使用和享受；
      </li>
      <li>
        您不会使用互动服务进行非法活动。
      </li>
    </ul>
    <p>
      我们保留权利，随时自行决定监控和审查用户贡献，并且我们有权删除任何用户贡献，违反这些使用条款的条款或其他不当、非法或侵权行为。我们不对您或任何第三方对任何用户贡献的准确性、完整性或实用性承担责任。
    </p>
    <p>
      请注意，任何用户贡献的观点和意见仅代表发布者的观点和意见，并不一定代表公司的观点和意见。
    </p>
    <h2>总结</h2>
    <p>
      这些使用条款构成您和公司之间关于服务的全部协议，取代您和公司之间的任何先前或同时的书面或口头协议。任何未经公司书面同意的使用服务的尝试均无效。
    </p>
    <p>
      如果您对这些使用条款有任何疑问，请联系我们。
    </p>
  </div>
</template>




        <script setup>
const description =
    "The Terms of Use of BBSMC, an open source modding platform focused on Minecraft.";

useSeoMeta({
  title: "Terms of Use - BBSMC",
  description,
  ogTitle: "Terms of Use",
  ogDescription: description,
});
</script>
